###############################################################################
# Created by write_sdc
###############################################################################
current_design riscv_top
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 17.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_I_n_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_I_p_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_Q_n_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_Q_p_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_in[0]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_in[1]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_in[2]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_in[3]}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_I_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Ix_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Q_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Qx_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {reset}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rx}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sda_i}]
set_input_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {so}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {I_ae}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {Q_ae}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {analog_en}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_I_n_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_I_oe}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_I_p_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_Q_n_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_Q_oe}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ds_Q_p_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_out[0]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_out[1]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_out[2]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {gpio_out[3]}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_I_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_I_oe}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Ix_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Q_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Q_oe}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {lo_Qx_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {scl}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sclk}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sda_o}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sda_oe}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {si}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {sram_ce}]
set_output_delay 3.0000 -clock [get_clocks {clk}] -add_delay [get_ports {tx}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0060 [get_ports {I_ae}]
set_load -pin_load 0.0060 [get_ports {Q_ae}]
set_load -pin_load 0.0060 [get_ports {analog_en}]
set_load -pin_load 0.0060 [get_ports {ds_I_n_o}]
set_load -pin_load 0.0060 [get_ports {ds_I_oe}]
set_load -pin_load 0.0060 [get_ports {ds_I_p_o}]
set_load -pin_load 0.0060 [get_ports {ds_Q_n_o}]
set_load -pin_load 0.0060 [get_ports {ds_Q_oe}]
set_load -pin_load 0.0060 [get_ports {ds_Q_p_o}]
set_load -pin_load 0.0060 [get_ports {lo_I_o}]
set_load -pin_load 0.0060 [get_ports {lo_I_oe}]
set_load -pin_load 0.0060 [get_ports {lo_Ix_o}]
set_load -pin_load 0.0060 [get_ports {lo_Q_o}]
set_load -pin_load 0.0060 [get_ports {lo_Q_oe}]
set_load -pin_load 0.0060 [get_ports {lo_Qx_o}]
set_load -pin_load 0.0060 [get_ports {scl}]
set_load -pin_load 0.0060 [get_ports {sclk}]
set_load -pin_load 0.0060 [get_ports {sda_o}]
set_load -pin_load 0.0060 [get_ports {sda_oe}]
set_load -pin_load 0.0060 [get_ports {si}]
set_load -pin_load 0.0060 [get_ports {sram_ce}]
set_load -pin_load 0.0060 [get_ports {tx}]
set_load -pin_load 0.0060 [get_ports {gpio_out[3]}]
set_load -pin_load 0.0060 [get_ports {gpio_out[2]}]
set_load -pin_load 0.0060 [get_ports {gpio_out[1]}]
set_load -pin_load 0.0060 [get_ports {gpio_out[0]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ds_I_n_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ds_I_p_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ds_Q_n_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ds_Q_p_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lo_I_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lo_Ix_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lo_Q_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {lo_Qx_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {reset}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rx}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {sda_i}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {so}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[3]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[2]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[1]}]
set_driving_cell -lib_cell sg13g2_buf_4 -pin {X} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {gpio_in[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 10.0000 [current_design]
